# IsValidValue Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AssetPropertyList..::..IsValidValue Method
AssetPropertyList Class See Also
---
Check that value is valid.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public bool IsValidValue(
	IList<AssetProperty> value
)
```

Visual Basic
---
```text
Public Function IsValidValue ( _
	value As IList(Of AssetProperty) _
) As Boolean
```

Visual C++
---
```text
public:
bool IsValidValue(
	IList<AssetProperty^>^ value
)
```

# ### Parameters
value
    Type: System.Collections.Generic..::..IList<(Of <(<'AssetProperty>)>)> The array of properties to validate.
# ### Return Value
Returns true if the array of properties is valid, false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Cannot check validity for a property not being edited in AppearanceAssetEditScope. |

# See Also
AssetPropertyList Class
Autodesk.Revit.DB.Visual Namespace